report.txt

Request Details:
URL:https://www.w3schools.com/xml/tempconvert.asmx
Method:POST
Headers:{SOAPAction=https://www.w3schools.com/xml/FahrenheitToCelsius, Accept=*/*, Content-Type=text/xml; charset=ISO-8859-1}
Cookies:{}
Body:<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <FahrenheitToCelsius xmlns="https://www.w3schools.com/xml/">
      <Fahrenheit>100</Fahrenheit>
    </FahrenheitToCelsius>
  </soap:Body>
</soap:Envelope>
Curl request:curl -v -X POST 'https://www.w3schools.com/xml/tempconvert.asmx' -H 'SOAPAction: https://www.w3schools.com/xml/FahrenheitToCelsius' -H 'Accept: */*' -H 'Content-Type: text/xml; charset=ISO-8859-1' -d '<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">  <soap:Body>    <FahrenheitToCelsius xmlns="https://www.w3schools.com/xml/">      <Fahrenheit>100</Fahrenheit>    </FahrenheitToCelsius>  </soap:Body></soap:Envelope>'
Status code:200
Response:
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
  <soap:Body>
    <FahrenheitToCelsiusResponse xmlns="https://www.w3schools.com/xml/">
      <FahrenheitToCelsiusResult>37.7777777777778</FahrenheitToCelsiusResult>
    </FahrenheitToCelsiusResponse>
  </soap:Body>
</soap:Envelope>
